Revit 2024 API
EnergyAnalysisMaterial.MaterialName Property
 The name of the material.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public string MaterialName { get; }
Visual Basic
Public ReadOnly Property MaterialName As String
	Get
Visual C++
public:
property String^ MaterialName {
	String^ get ();
}
See Also
EnergyAnalysisMaterial Class
Autodesk.Revit.DB.Analysis Namespace